lib/tasks/import_bikes.rake

task :import_bikes => [:environment] do
    file = "notes/bike-data.csv"
    CSV.foreach(file, :headers => true) do |row|
        b_current_station = Station.find_by(identifier: row[1])
---
SELECT `stations`.* FROM `stations` WHERE `stations`.`identifier` = 25 LIMIT 1