app/views/phonenum/edit.html.erb

<%= form_with model: Current.user, url: edit_phone_path do |form| %>
    <% if Current.user.errors.any? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1