app/views/blocking/edit.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
<%= form_with url: edit_blocking_path do |form| %>
    <% if Current.user.errors.any? %>