app/views/payment/edit.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
            <%= form_with url: payment_path(params[:format]) do |form| %>
                <% if Current.user.errors.any? %>