app/views/bikes/new.html.erb

SELECT `stations`.* FROM `stations`
---
    <%= f.label :Select_Stations %>
    <%= f.collection_select :current_station_id, Station.all, :id, :name %>