app/views/passwords/edit.html.erb

<%= form_with model: Current.user, url: edit_password_path do |form| %>
    <% if Current.user.errors.any? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1