app/controllers/address_controller.rb

    def update
        if Current.user.update(address_params)
---
UPDATE `users` SET `users`.`address` = 'vwnur', `users`.`updated_at` = '2023-05-02 01:56:11.181110' WHERE `users`.`id` = 1