app/controllers/bikes_controller.rb

SELECT `bikes`.* FROM `bikes` ORDER BY `bikes`.`identifier` DESC
---
  def index
       if params[:reverse].blank? || params[:reverse]=="0"
            @bikes = Bike.all.order(identifier: :asc)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def unlock
     if session[:user_id]
          @user = User.find(session[:user_id])