app/controllers/blocking_controller.rb

    def update
        if Current.user.admin == true
            if @blockinguser = User.find_by(email: params[:email]) != nil
                @blocking_user = User.find_by(email: params[:email])
                @blocking_user.update(block: !@blocking_user.block)
                @blocking_user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'ybao81@smith.edu' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'try@ed.edu' LIMIT 1
UPDATE `users` SET `users`.`block` = FALSE, `users`.`updated_at` = '2023-04-30 07:27:14.404746' WHERE `users`.`id` = 4
UPDATE `users` SET `users`.`block` = TRUE, `users`.`updated_at` = '2023-04-30 07:11:19.202475' WHERE `users`.`id` = 4