app/controllers/pages_controller.rb

    def home
      if session[:email]
        @user = User.find(session[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1