app/controllers/passwords_controller.rb

    def update
        if Current.user.update(password_params)
---
UPDATE `users` SET `users`.`password_digest` = '$2a$12$Nakg7nM0dxsO2qreKd0B0..5SfEN8zcf3Mx8T6Yz/7mbpRmtVmMlW', `users`.`updated_at` = '2023-05-02 02:01:39.930844' WHERE `users`.`id` = 1