app/controllers/password_resets_controller.rb

    def create
        @user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'zyu20@smith.edu' LIMIT 1

    def update
        @user = User.find_signed(params[:token], purpose: "password_reset")
        if @user.update(password_params)
---
UPDATE `users` SET `users`.`password_digest` = '$2a$12$4lRW4Bz5ihAY5Bq9Tv6odOuPxjMEHNBzndualZ7QivGL3A4ZRwr3.', `users`.`updated_at` = '2023-04-16 20:39:42.384715' WHERE `users`.`id` = 5