app/controllers/payment_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
SELECT `rental`.* FROM `rental` WHERE `rental`.`id` = 18 LIMIT 1
---
    def edit
        if session[:user_id]
            @user = User.find(session[:user_id])
        end
        if session[:payment_id]
            @rental = Rental.find(session[:payment_id])

SELECT `bikes`.* FROM `bikes` WHERE `bikes`.`identifier` = 3740 LIMIT 1
SELECT `rental`.* FROM `rental` WHERE `rental`.`id` = 69 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2023-04-27 23:50:32.875758', `users`.`wallet_point` = 94 WHERE `users`.`id` = 7
---
    def update
        @bike= Bike.find_by_identifier(params[:format])
        if session[:payment_id]
            @rental = Rental.find(session[:payment_id])
        end
        if params[:yn_wallet] == "y" || params[:yn_wallet] == "Y"  || params[:yn_wallet] == "Yes" ||params[:yn_wallet] == "yes"
            @price = @rental.hours
            if @price > Current.user.wallet_point
                flash[:success]="Not enough money point in your Wallet"
                redirect_to change_wallet_path
            else
                @bike.update({current_station_id: nil })
                Current.user.wallet_point-=@price
                Current.user.save