app/controllers/phonenum_controller.rb

UPDATE `users` SET `users`.`phone_num` = '929977010', `users`.`updated_at` = '2023-05-02 02:04:08.023604' WHERE `users`.`id` = 1
---
    def update
        if Current.user.update(phonenum_params)