app/controllers/rentals_controller.rb

    def create
        puts "rental is #{@rental}"
        @rental = Rental.new(params.require(:rental).permit(:user_id, :bike_id, :start_station_id, :end_station_id, :end_time, :price, :start_time, :end_time ))
        @rental.save
        if @rental.save
            @current_bike = Bike.where(id: @rental.bike_id )
            @current_bike.update(current_station_identifier: 0, status: 1)
            @rental.save
---
UPDATE `users` SET `users`.`updated_at` = '2023-04-25 19:18:43.586653', `users`.`wallet_point` = 234 WHERE `users`.`id` = 5