app/controllers/rentals_controller.rb

    def new
      @bike= Bike.find_by_identifier(params[:format])
---
SELECT `bikes`.* FROM `bikes` WHERE `bikes`.`identifier` = 3740 LIMIT 1

    def create
      @rental = Rental.new(rental_params)
      @price = @rental.hours
      if @rental.save
        @bike= Bike.find_by_identifier(params[:format])
---
INSERT INTO `rental` (`hours`, `price`, `created_at`, `updated_at`) VALUES (1, NULL, '2023-04-25 19:23:12.053199', '2023-04-25 19:23:12.053199')
SELECT `bikes`.* FROM `bikes` WHERE `bikes`.`identifier` = 3740 LIMIT 1

    def return
      @bikes= Bike.find_by_identifier(params[:format])
      @bikes.update({current_station_id: $s })
---
SELECT `bikes`.* FROM `bikes` WHERE `bikes`.`identifier` IS NULL LIMIT 1
UPDATE `bikes` SET `bikes`.`current_station_id` = 7, `bikes`.`updated_at` = '2023-05-02 01:02:01.566226' WHERE `bikes`.`id` = 2