app/controllers/reports_controller.rb

    def create

       if report_params= " "
        redirect_to '/reports/empty'

      else
        @report = Report.new(report_params)

        if @report.save
---
INSERT INTO `reports` (`description`, `created_at`, `updated_at`) VALUES (NULL, '2023-05-01 00:02:36.885360', '2023-05-01 00:02:36.885360')