app/controllers/stations_controller.rb

SELECT `stations`.* FROM `stations` WHERE `stations`.`identifier` = 22 LIMIT 1
---
  def index
    @all_stations = Station.all.order(identifier: :asc)

INSERT INTO `stations` (`identifier`, `name`, `address`, `created_at`, `updated_at`) VALUES (18, 'dddd', 'wqe', '2023-04-28 01:36:55.992966', '2023-04-28 01:36:55.992966')
---
  def create
    @station = Station.new(station_params)
    if @station.save

SELECT `stations`.* FROM `stations` WHERE `stations`.`identifier` = 18 LIMIT 1
---
  def search
    @all_stations = Station.all.order(identifier: :asc)