app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO `users` (`username`, `password_digest`, `email`, `phone_num`, `address`, `birthday`, `admin`, `block`, `wallet_point`, `default_payment`, `created_at`, `updated_at`) VALUES ('e', '$2a$12$I2Elr3AhyX9NYM8qo7imL.sXtim4Ve6mql/ZatTl5avjrBvb3lKZ2', 'eschumacher@smith.edu', '', '385 Massachusetts Ave', '2001-02-03', NULL, NULL, NULL, '', '2023-04-27 00:45:02.712744', '2023-04-27 00:45:02.712744')

    def show
        if session[:user_id]
            @user = User.find(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1