app/controllers/username_controller.rb

    def update
        if  Current.user
            Current.user.update(username: params[:username])
---
UPDATE `users` SET `users`.`username` = 'bikes', `users`.`updated_at` = '2023-05-02 02:00:24.872689' WHERE `users`.`id` = 1