app/views/wallet/edit.html.erb

<%= form_with url: edit_wallet_path do |form| %>
    <% if Current.user.errors.any? %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1